SELECT 
    Н_УЧЕНИКИ.ГРУППА, 
    Н_УЧЕНИКИ.ИД, 
    Н_ЛЮДИ.ФАМИЛИЯ,
    Н_ЛЮДИ.ИМЯ,
    Н_ЛЮДИ.ОТЧЕСТВО,
    Н_УЧЕНИКИ.П_ПРКОК_ИД
FROM Н_УЧЕНИКИ
JOIN Н_ЛЮДИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
JOIN Н_ПЛАНЫ ON Н_ПЛАНЫ.ИД = Н_УЧЕНИКИ.ПЛАН_ИД
WHERE Н_УЧЕНИКИ.ПРИЗНАК = 'отчисл'
AND Н_УЧЕНИКИ.КОНЕЦ_ПО_ПРИКАЗУ > to_timestamp('2012-09-01 00:00:00', 'YYYY-MM-DD HH24:MI:SS')
AND Н_ПЛАНЫ.ФО_ИД IN (
    SELECT Н_ФОРМЫ_ОБУЧЕНИЯ.ИД FROM Н_ФОРМЫ_ОБУЧЕНИЯ
    WHERE Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Очная'
    OR Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Заочная'
)
AND Н_ПЛАНЫ.НАПС_ИД = (
    SELECT Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.ИД FROM Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ
    JOIN Н_НАПР_СПЕЦ ON Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.НС_ИД = Н_НАПР_СПЕЦ.ИД
    WHERE Н_НАПР_СПЕЦ.КОД_НАПРСПЕЦ = '230101'
);